### **Customer lifetime value**
**MBDS DDB Tania Cajal Assignment 4**

CLTV = (Customer_Value * Profit_margin) /  Churn_Rate

Customer_Value = Average_Order_Value * Purchase_Frequency

Average_Order_Value = Total_Revenue / Total_Number_of_Orders

Purchase_Frequency =  Total_Number_of_Orders / Total_Number_of_Customers

Churn_Rate = 1 - Repeat_Rate

1000 %25 Have Retention in one year = Churn Rate = %75...   1/0.75*12 M.
Profit_margin

In [37]:
import pandas as pd
import matplotlib.pyplot as plt
pd.set_option('display.max_columns', 20)
# pd.set_option('display.max_rows', 20)
pd.set_option('display.float_format', lambda x: '%.5f' % x)
from sklearn.preprocessing import MinMaxScaler

In [38]:
df_ = pd.read_excel(r"online_retail_II.xlsx",
                    sheet_name="Year 2010-2011")
df = df_.copy()
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55000,17850.00000,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75000,17850.00000,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom

**DATA PREPARATION**

Please Calculate LTV for the countries below;

United Kingdom

Germany

France

Spain

In [39]:
df.shape

(541910, 8)

In [40]:
df['Country'].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Austria',
       'Israel', 'Finland', 'Bahrain', 'Greece', 'Hong Kong', 'Singapore',
       'Lebanon', 'United Arab Emirates', 'Saudi Arabia',
       'Czech Republic', 'Canada', 'Unspecified', 'Brazil', 'USA',
       'European Community', 'Malta', 'RSA'], dtype=object)

In [41]:
countries = ['United Kingdom', 'Germany', 'France', 'Spain']
df = df[df.Country.isin(countries)]

df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55000,17850.00000,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75000,17850.00000,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom

In [42]:
# Check if filtered

df['Country'].unique()

array(['United Kingdom', 'France', 'Germany', 'Spain'], dtype=object)

In [43]:
df = df[~df["Invoice"].str.contains("C", na=False)]
df.shape

(507558, 8)

In [44]:
df = df[(df['Quantity'] > 0)]
df.dropna(inplace=True)

df.shape

(374215, 8)

In [45]:
df["TotalPrice"] = df["Quantity"] * df["Price"]

df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55000,17850.00000,United Kingdom,15.30000
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom,20.34000
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75000,17850.00000,United Kingdom,22.00000
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom,20.34000
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39000,17850.00000,United Kingdom,20.34000

In [46]:
cltv_df = df.groupby('Customer ID').agg({'Invoice': lambda x: x.nunique(),
                                         'Quantity': lambda x: x.sum(),
                                         'TotalPrice': lambda x: x.sum()})

cltv_df.columns = ['total_transaction', 'total_unit', 'total_price']

cltv_df.head()

             total_transaction  total_unit  total_price
Customer ID
12346.00000                  1       74215  77183.60000
12354.00000                  1         530   1079.40000
12413.00000                  3         286    758.10000
12417.00000                  1         267    436.30000
12421.00000                  4         484    807.04000

**AVERAGE ORDER VALUE**

In [47]:
cltv_df.shape[0]

4132

In [48]:
cltv_df['avg_order_value'] = cltv_df['total_price'] / cltv_df['total_transaction']
cltv_df.head()

             total_transaction  total_unit  total_price  avg_order_value
Customer ID
12346.00000                  1       74215  77183.60000      77183.60000
12354.00000                  1         530   1079.40000       1079.40000
12413.00000                  3         286    758.10000        252.70000
12417.00000                  1         267    436.30000        436.30000
12421.00000                  4         484    807.04000        201.76000

**PURCHASE FREQUENCY**
Keep an eye out for outliers ðŸ‘€!

In [49]:
cltv_df.describe().T

,count,mean,std,min,25%,50%,75%,max
total_transaction,4132.00000,4.25581,7.11867,1.00000,1.00000,2.00000,5.00000,210.00000
total_unit,4132.00000,1095.87585,3665.12533,1.00000,158.00000,371.00000,976.25000,80997.00000
total_price,4132.00000,1889.61226,7330.54534,0.00000,302.99250,659.42500,1615.85500,259657.30000
avg_order_value,4132.00000,399.87764,1826.21945,0.00000,176.46125,285.84150,417.43500,84236.25000

In [50]:
def outlier_thresholds(dataframe, col_name, q1=0.25, q3=0.75):
    quartile1 = dataframe[col_name].quantile(q1)
    quartile3 = dataframe[col_name].quantile(q3)
    interquantile_range = quartile3 - quartile1
    up_limit = quartile3 + 1.5 * interquantile_range
    low_limit = quartile1 - 1.5 * interquantile_range
    return low_limit, up_limit

In [51]:
def replace_with_thresholds(dataframe, variable):
    low_limit, up_limit = outlier_thresholds(dataframe, variable)
    dataframe.loc[(dataframe[variable] < low_limit), variable] = low_limit
    dataframe.loc[(dataframe[variable] > up_limit), variable] = up_limit

In [52]:
outlierTest = ["total_transaction","total_unit","total_price","avg_order_value"]

for col in outlierTest:
    replace_with_thresholds(cltv_df,col)

cltv_df.head()

             total_transaction  total_unit  total_price  avg_order_value
Customer ID
12346.00000                  1  2203.62500   3585.14875        778.89562
12354.00000                  1   530.00000   1079.40000        778.89562
12413.00000                  3   286.00000    758.10000        252.70000
12417.00000                  1   267.00000    436.30000        436.30000
12421.00000                  4   484.00000    807.04000        201.76000

In [53]:
cltv_df.shape

(4132, 4)

In [54]:
cltv_df.shape[0]

4132

In [55]:
#cltv_df["purchase_frequency"] = cltv_df['total_transaction']/ cltv_df.shape[0]
purchase_frequency = cltv_df['total_transaction'].sum() / cltv_df.shape[0]
purchase_frequency

3.5077444336882864

**REPEAT RATE AND CHURN RATE**

In [56]:
repeat_rate = cltv_df[cltv_df.total_transaction > 1].shape[0] / cltv_df.shape[0]
repeat_rate

0.6573088092933205

In [57]:
churn_rate = 1 - repeat_rate # in one year
churn_rate # in one year

0.3426911907066795

In [58]:
LT = 1/churn_rate
churn_rate

0.3426911907066795

In [59]:
print(LT) # 3 year
print(LT*12) # 3 year

2.918079096045198
35.01694915254238

In [60]:
# margin is 0.15
CLTV = LT * purchase_frequency * cltv_df['avg_order_value'].mean() * 0.15
print("Customer Life Time Value for All Customers :" , CLTV)

Customer Life Time Value for All Customers : 495.8496263929652

**CAC RATIO**
For CAC=100 pounds

In [61]:
CLTV_CAC_Ratio = CLTV/100
print("CLTV_CAC_Ratio :" , CLTV_CAC_Ratio)

cltv_df.head()

CLTV_CAC_Ratio : 4.958496263929652

             total_transaction  total_unit  total_price  avg_order_value
Customer ID
12346.00000                  1  2203.62500   3585.14875        778.89562
12354.00000                  1   530.00000   1079.40000        778.89562
12413.00000                  3   286.00000    758.10000        252.70000
12417.00000                  1   267.00000    436.30000        436.30000
12421.00000                  4   484.00000    807.04000        201.76000

**RULE BASED SEGMENTATION**

In [62]:
cltv_df["segment"] = pd.qcut(cltv_df["avg_order_value"], 4, labels=["D", "C", "B", "A"])
cltv_df.head()

,total_transaction,total_unit,total_price,avg_order_value,segment
Customer ID,,,,,
12346.00000,1,2203.62500,3585.14875,778.89562,A
12354.00000,1,530.00000,1079.40000,778.89562,A
12413.00000,3,286.00000,758.10000,252.70000,C
12417.00000,1,267.00000,436.30000,436.30000,A
12421.00000,4,484.00000,807.04000,201.76000,C

In [63]:
cltv_segments = cltv_df.groupby("segment")[["avg_order_value", "total_transaction"]].agg({"count", "mean"})
cltv_segments

        avg_order_value       total_transaction
                   mean count              mean count
segment
D             121.99095  1033           2.55760  1033
C             225.56104  1033           3.71055  1033
B             344.75525  1033           3.74250  1033
A             599.48812  1033           4.02033  1033